In [1]:
import numpy as np 
import pandas as pd

In [2]:
df1 = pd.DataFrame() 
df2 = pd.DataFrame()

In [3]:
df1['viewers'] = ["Matthew", "Mark", "Luke", "John"] 
df2['users'] = ["Mark", "John", "Luke", "Matthew", "Peter"]

In [4]:
df1 = df1.assign(views = np.random.normal(100, 100, 4))
df2 = df2.assign(cost = [20, np.nan, 1, 2, 7])

In [5]:
df1.head()

   viewers       views
0  Matthew   72.106918
1     Mark  -24.951915
2     Luke   65.935388
3     John  125.778253

In [6]:
df2.head()

     users  cost
0     Mark  20.0
1     John   NaN
2     Luke   1.0
3  Matthew   2.0
4    Peter   7.0

In [7]:
df = df1.merge(df2, left_on="viewers", right_on="users", how="left")
df.head()

   viewers       views    users  cost
0  Matthew   72.106918  Matthew   2.0
1     Mark  -24.951915     Mark  20.0
2     Luke   65.935388     Luke   1.0
3     John  125.778253     John   NaN

In [8]:
df.fillna(-1)

   viewers       views    users  cost
0  Matthew   72.106918  Matthew   2.0
1     Mark  -24.951915     Mark  20.0
2     Luke   65.935388     Luke   1.0
3     John  125.778253     John  -1.0